from telegram import InlineKeyboardButton
from django.utils.safestring import mark_safe

main_keyboard = [
    ["Послуги та вартість"],
    ["Контакти"]
]

services_keyboard = [
    ["Консультація по лініях зовнішності та стилю"],
    ["Розбір гардероба", "Капсульний гардероб"],
    ["Оновлений гардероб", "Безплатна консультація"],
    ["Підбір образу на важливу подію чи зйомку"],
    ["Обрати послугу і записатись"],
    ["👈🏻 Повернутись до головного меню"],
]

choose_service_buttons = [
        [
            InlineKeyboardButton("Консультація по лініях зовнішності та стилю", callback_data='consultation'),
        ],
        [
            InlineKeyboardButton("Розбір гардероба", callback_data='wardrobe_analysis'),
            InlineKeyboardButton("Капсульний гардероб", callback_data='capsule_wardrobe'),
        ],
        [
            InlineKeyboardButton("Оновлений гардероб", callback_data='wardrobe_update'),
            InlineKeyboardButton("Безплатна консультація", callback_data='free_consultation'),
        ],
        [
            InlineKeyboardButton("Підбір образу на важливу подію чи зйомку", callback_data='event_outfit'),
        ]
    ]

contacts_keyboard = [
    ["👈🏻 Повернутись до головного меню"]
]

sign_in_keyboard = [
    ["👤 Ім'я", "📩 Email"],
    ["Обрати послугу"],
    ["👈🏻 Повернутись"],
]

email_and_service_keyboard = [
    ["📩 Email"],
    ["Обрати послугу"],
    ["👈🏻 Повернутись"],
]

name_and_email_keyboard = [
    ["👤 Ім'я", "📩 Email"],
    ["👈🏻 Повернутись"],
]

name_and_service_keyboard = [
    ["👤 Ім'я"],
    ["Обрати послугу"],
    ["👈🏻 Повернутись"],
]

service_and_return_keyboard = [
    ["Обрати послугу"],
    ["👈🏻 Повернутись"],
]

name_keyboard = [
    ["👤 Ім'я"],
    ["👈🏻 Повернутись"],
]

email_keyboard = [
    ["📩 Email"],
    ["👈🏻 Повернутись"],
]

return_keyboard = [
    ["👈🏻 Повернутись"],
]

questionnaire_keyboard = [
    ["Записатись"],
    ["👈🏻 Повернутись"]
]

cancel_keyboard = [
    ["Відмінити"],
]


GREETING_MESSAGE = f"це персональний стиліст Юлія. В цьому чат-боті ти можеш дізнатись " \
                   f"більш детально про мої послуги та чим я можу бути тобі корисна.\n" \
                   f"Пориньмо у світ стилю разом!"

FREE_CONSULT_CAPTURE = f"Якщо ви не можете визначитись з послугою ця консультація допоможе.\n" \
                    f"На ній ми визначимо ваш гардеробний запит та напрямок роботи.\n"\
                    f"\n" \
                    f"*ця консультація не зобов'язує до замовлення послуги.\n" \
                    f"\n"

APPEARANCE_AND_STYLE_CONSULTATION_CAPTURE = f"Етапи роботи:\n" \
                                            f"\n" \
                                            f"• починаємо роботу з анкетування, щоб визначити ваші вподобання, стиль, пропорції та тип фігури.\n" \
                                            f"• після того як ви заповните анкету, " \
                                            f"я починаю готувати презентацію. \n" \
                                            f"• ми узгоджуємо зручний час для консультації.\n" \
                                            f"• після неї я надсилаю презентацію, це робочий файл який буде актуальним впродовж життя.\n" \
                                            f"\n" \
                                            f"Чим корисна ця послуга?\n" \
                                            f"\n" \
                                            f"• ви дізнаєтесь про свій тип фігури, лінії зовнішності, гармонійні кольори, фасони речей, довжини  та тканини.\n" \
                                            f"• про правильні пропорції в образах.\n" \
                                            f"• про стилістичні приймання, які підкреслять саме вашу зовнішність та зроблять образи цікавішими.\n" \
                                            f"• стилістичні прийоми (секрети та лайфхаки по корекції саме вашої фігури)\n" \
                                            f"• відповім на всі запитання щодо вашого вектора стилю та гардероба.\n" \
                                            f"\n"

SORTING_WARDROBE_CAPTURE = f"Етапи роботи:\n" \
                            f"\n" \
                            f"• починаємо роботу з анкетування, щоб визначити ваші вподобання, стиль, пропорції та тип фігури.\n" \
                            f"• надсилаєте мені фото вашого гардероба.\n" \
                            f"• після цього я починаю готувати презентацію.\n" \
                            f"• ми узгоджуємо зручний час для конференції.\n" \
                            f"• після нашої конференції я надсилаю презентацію, та залишаюсь з вами на звʼязку впродовж місяця.\n" \
                            f"\n" \
                            f"Чим корисна ця послуга?\n" \
                            f"\n" \
                            f"• ви дізнаєтесь про свій тип фігури, лінії зовнішності, гармонійні кольори, фасони речей, довжини та тканини.\n" \
                            f"• пропрацюємо кожну категорію речей у вашому гардеробі.\n" \
                            f"• отримаєте готові образи на сезон + натхнення на нові.\n" \
                            f"• сформуємо ваш стиль, визначимо вектор стилю на майбутнє.\n" \
                            f"• отримаєте шопінг-лист з речей, які потрібно оновити або докупити.\n" \
                            f"\n"

CAPSULE_WARDROBE_CAPTURE = f"Етапи роботи:\n" \
                           f"\n" \
                           f"• визначаємо ваш запит (капсула на сезон, капсула у відпустку, капсула в офіс, для бізнес-подорожей тощо)\n" \
                           f"• починаємо роботу з анкетування, щоб визначити ваші вподобання, стиль, пропорції та тип фігури.\n" \
                           f"• після цього я починаю готувати презентацію та шопінг-лист.\n" \
                           f"• ми узгоджуємо зручний час для конференції.\n" \
                           f"• після нашої конференції я надсилаю презентацію та залишаюсь з вами на звʼязку, щоб допомогти з шопінгом.\n" \
                           f"\n" \
                           f"Чим корисна ця послуга?\n" \
                           f"\n" \
                           f"• отримаєте повністю готові формули образів з 10-30 речей (з урахуванням взуття та аксесуари),  які підходять до вашого типу фігури та зовнішності.\n" \
                           f"• можливість по іншому подивитись на свій гардероб, почати експеримент з капсули.\n" \
                           f"• отримаєте готовий шопінг-лист.\n" \
                           f"• зручне рішення для ділових поїздок, відпустки.\n" \
                           f"• екологічний підхід до життя з мінімальною кількістю речей.\n"

BIG_STYLE_UPGRADE_CAPTURE = f"Чим корисна ця послуга?\n" \
                            f"\n" \
                            f"• це комплексна послуга, яка допоможе закрити основні питання з гардеробом на сезон.\n" \
                            f"• ви дізнаєтесь про свій тип фігури, лінії зовнішності, гармонійні кольори, фасони речей, правильну посадку та розміри.\n" \
                            f"• пропрацюємо кожну категорію речей у вашій шафі.\n" \
                            f"• стилістичні прийоми саме під вас.\n" \
                            f"• методи корекції фігури.\n" \
                            f"• дізнаєтесь про актуальні тренди, та як їх підлаштувати під себе.\n" \
                            f"• отримаєте готові образи на сезон + натхнення на нові.\n" \
                            f"• визначимо вектор стилю на майбутнє.\n" \
                            f"• отримаєте шопінг-лист з речей, які потрібно оновити або докупити.\n" \
                            f"• моя підтримка під час шопінгу: знайдемо альтернативи речей під будь-який бюджет, визначимось з розміром.\n" \
                            f"• моя підтримка після завершення співпраці 3 місяці.\n"\

CHOOSING_FOR_IMPORTANT_EVENT_CAPTURE = f"Етапи роботи:\n" \
                                       f"\n" \
                                       f"• визначаємо ваш запит.\n" \
                                       f"• починаємо роботу з анкетування для того, щоб визначити ваші вподобання, стиль, референси для образа.\n" \
                                       f"• після цього я починаю готувати презентацію з ідеями та образами з вашого активного гардероба або з нових речей.\n" \
                                       f"• надсилаю вам презентацію та за потребою домовимось про online-конференцію.\n" \
                                       f"• залишаюсь з вами на зв'язку ДО та в день Х.\n" \
                                       f"\n" \
                                       f"Чим корисна ця послуга?\n" \
                                       f"\n" \
                                       f"• 100% готовість до вашої важливої події.\n" \
                                       f"• допоможу з ідеями та знайду стильну реалізацію для ваших.\n" \
                                       f"• ви отримуєте презентацію з 10 готовими образами, ідеями для макіяжу та зачіски також.\n" \
                                       f"• всі образи підібрані під ваш тип фігури та зовнішність.\n" \
                                       f"\n"


SIGN_IN_TEXT = f"Залишить ваші зручні контакти, та оберить послугу i я зв'яжусь з вами та надішлю анкету для початку нашої роботи!"

SIGN_IN_TEXT_BEFORE_NAME = "Введіть своє ім'я:"

SIGN_IN_TEXT_AFTER_NAME = "Введіть свій email."

CHOOSE_SERVICE_TEXT = "Оберіть послугу"

FREE_CONSULT_PICTURE_URL = "http://surl.li/lrtgc"

APPEARANCE_AND_STYLE_CONSULTATION_URL = "http://surl.li/mdvzd"

SORTING_WARDROBE_URL = "http://surl.li/meiuk"

CAPSULE_WARDROBE_URL = "http://surl.li/meqtz"

BIG_STYLE_UPGRADE_URL = "http://surl.li/mflns"

CHOOSING_FOR_IMPORTANT_EVENT_URL = "http://surl.li/mflyr"

MY_EMAIL = "yuliiatko@gmail.com"
TG = "@yuliiatkostylist"

